In [1]:
print("OK")

OK

In [4]:
import pandas as pd
import numpy as np

In [12]:
# sep=";" specifies that columns in the CSV are separated by semicolons
# on_bad_lines="skip" tells Pandas to ignore rows that can't be parsed correctly
# encoding="latin-1" ensures compatibility with special characters in the file

books = pd.read_csv('BX-Books.csv', sep=";", on_bad_lines="skip", encoding='latin-1')

C:\Users\men_l\AppData\Local\Temp\ipykernel_8204\853055035.py:5: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books = pd.read_csv('BX-Books.csv', sep=";", on_bad_lines="skip", encoding='latin-1')

In [13]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [15]:
# Access the large image URL from row 237 of the 'books' DataFrame
# .iloc[237] selects the 238th row (indexing starts at 0)
# ['Image-URL-L'] extracts the value from the 'Image-URL-L' column, which contains the URL of the large book cover image

books.iloc[237]['Image-URL-L']

'http://images.amazon.com/images/P/0671027387.01.LZZZZZZZ.jpg'

In [18]:
# Get the shape (dimensions) of the 'books' DataFrame
# books.shape returns a tuple (rows, columns)
# rows: total number of book entries in the dataset
# columns: total number of attributes/features about each book

books.shape

(271360, 8)

In [19]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [22]:
# Select specific columns from the 'books' DataFrame to create a refined version
# This keeps only the most relevant details about each book, removing any unnecessary columns
# Columns included: ISBN, Title, Author, Year, Publisher, and URLs for different image sizes

books = books[['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher', 'Image-URL-L']]

In [23]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...

In [24]:
books.rename(columns={'Book-Title': 'title',  
                      'Book-Author': 'author',  
                      'Year-Of-Publication': 'year',  
                      'Publisher': 'publisher',  
                      'Image-URL-L': 'image_url'}, inplace=True)

In [25]:
books.head()

,ISBN,title,author,year,publisher,image_url
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...

In [27]:
# Load the BX-Users.csv file into a Pandas DataFrame
# sep=";" specifies that columns in the CSV are separated by semicolons
# on_bad_lines="skip" tells Pandas to ignore rows that can't be parsed correctly (recommended over deprecated error_bad_lines)
# encoding="latin-1" ensures proper handling of special characters in the file

users = pd.read_csv('BX-Users.csv', sep=";", on_bad_lines="skip", encoding='latin-1')

In [28]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [30]:
users.shape

(278858, 3)

In [31]:
users.columns

Index(['User-ID', 'Location', 'Age'], dtype='object')

In [32]:
users.rename(columns={'User-ID': 'user_id', 
                      'Location': 'location', 
                      'Age': 'age'}, inplace=True)

In [34]:
users.head()

   user_id                            location   age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [36]:
# Load the BX-Book-Ratings.csv file into a Pandas DataFrame
# sep=";" specifies that columns in the CSV are separated by semicolons
# on_bad_lines="skip" skips any rows that cannot be parsed correctly (recommended over the deprecated error_bad_lines)
# encoding="latin-1" ensures proper handling of special characters in the file

ratings = pd.read_csv('BX-Book-Ratings.csv', sep=";", on_bad_lines="skip", encoding='latin-1')

In [37]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [39]:
ratings.shape

(1149780, 3)

In [41]:
ratings.columns

Index(['User-ID', 'ISBN', 'Book-Rating'], dtype='object')

In [42]:
ratings.rename(columns={'User-ID': 'user_id',
                        'Book-Rating': 'rating'}, inplace=True)

In [43]:
ratings.head()

   user_id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5
2   276727  0446520802       0
3   276729  052165615X       3
4   276729  0521795028       6

In [44]:
print(books.shape, users.shape, ratings.shape, sep='\n')

(271360, 6)
(278858, 3)
(1149780, 3)

In [45]:
# Count the number of ratings each user has submitted
# ratings['user_id'] selects the user_id column, which contains unique user identifiers
# .value_counts() counts how many times each user_id appears (i.e., how many ratings each user has given)
# The output is sorted by default, showing the most active users first

ratings['user_id'].value_counts()

user_id
11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
116180        1
116166        1
116154        1
116137        1
276723        1
Name: count, Length: 105283, dtype: int64

In [48]:
# Create a Boolean Series to identify users who have rated more than 200 books
# ratings['user_id'].value_counts() counts how many ratings each user has submitted
# > 200 checks if the user's rating count exceeds 200
# The result is True for users with more than 200 ratings and False otherwise

x = ratings['user_id'].value_counts() > 200

In [49]:
x

user_id
11676      True
198711     True
153662     True
98391      True
35859      True
          ...
116180    False
116166    False
116154    False
116137    False
276723    False
Name: count, Length: 105283, dtype: bool

In [51]:
# Count the number of users who have rated more than 200 books
# x[x] filters the Series to include only users where x is True (i.e., those with >200 ratings)
# .shape returns the number of rows, indicating how many users meet this condition

x[x].shape

(899,)

In [53]:
# Get the user IDs of users who have rated more than 200 books
# x[x] filters the Series to keep only users with >200 ratings (where x is True)
# .index retrieves the user IDs of these highly active users

y = x[x].index

In [54]:
y

Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352, 110973,
       235105,
       ...
       260183,  73681,  44296, 155916,   9856, 274808,  28634,  59727, 268622,
       188951],
      dtype='int64', name='user_id', length=899)

In [56]:
# Filter the ratings DataFrame to include only users who have rated more than 200 books
# ratings['user_id'].isin(y) checks if each user_id is present in the list y (highly active users)
# ratings[...] selects only the rows where the condition is True, keeping only ratings from frequent reviewers

ratings = ratings[ratings['user_id'].isin(y)]

In [58]:
ratings.head()

      user_id        ISBN  rating
1456   277427  002542730X      10
1457   277427  0026217457       0
1458   277427  003008685X       8
1459   277427  0030615321       0
1460   277427  0060002050       0

In [59]:
# Merge the ratings DataFrame with the books DataFrame based on the 'ISBN' column
# This combines book details with user ratings, ensuring each rating now includes book information
# 'on="ISBN"' ensures the merge happens using the common column 'ISBN' that exists in both DataFrames

ratings_with_books = ratings.merge(books, on='ISBN')

In [60]:
ratings_with_books.head()

,user_id,ISBN,rating,title,author,year,publisher,image_url
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...
1,277427,0026217457,0,Vegetarian Times Complete Cookbook,Lucy Moll,1995,John Wiley &amp; Sons,http://images.amazon.com/images/P/0026217457.0...
2,277427,003008685X,8,Pioneers,James Fenimore Cooper,1974,Thomson Learning,http://images.amazon.com/images/P/003008685X.0...
3,277427,0030615321,0,"Ask for May, Settle for June (A Doonesbury book)",G. B. Trudeau,1982,Henry Holt &amp; Co,http://images.amazon.com/images/P/0030615321.0...
4,277427,0060002050,0,On a Wicked Dawn (Cynster Novels),Stephanie Laurens,2002,Avon Books,http://images.amazon.com/images/P/0060002050.0...

In [61]:
# Group the ratings_with_books DataFrame by the 'title' column to count the number of ratings for each book
# .groupby('title') organizes the data by book titles
# ['rating'].count() calculates how many ratings each book has received
# .reset_index() ensures the result is returned as a DataFrame instead of a grouped object

number_rating = ratings_with_books.groupby('title')['rating'].count().reset_index()

In [62]:
number_rating.head()

                                               title  rating
0   A Light in the Storm: The Civil War Diary of ...       2
1                              Always Have Popsicles       1
2               Apple Magic (The Collector's series)       1
3   Beyond IBM: Leadership Marketing and Finance ...       1
4   Clifford Visita El Hospital (Clifford El Gran...       1

In [63]:
number_rating.rename(columns={'rating': 'number_of_rating'}, inplace=True)

In [64]:
number_rating.head()

                                               title  number_of_rating
0   A Light in the Storm: The Civil War Diary of ...                 2
1                              Always Have Popsicles                 1
2               Apple Magic (The Collector's series)                 1
3   Beyond IBM: Leadership Marketing and Finance ...                 1
4   Clifford Visita El Hospital (Clifford El Gran...                 1

In [65]:
final_rating = ratings_with_books.merge(number_rating, on='title')

In [66]:
final_rating.head()

,user_id,ISBN,rating,title,author,year,publisher,image_url,number_of_rating
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...,82
1,277427,0026217457,0,Vegetarian Times Complete Cookbook,Lucy Moll,1995,John Wiley &amp; Sons,http://images.amazon.com/images/P/0026217457.0...,7
2,277427,003008685X,8,Pioneers,James Fenimore Cooper,1974,Thomson Learning,http://images.amazon.com/images/P/003008685X.0...,1
3,277427,0030615321,0,"Ask for May, Settle for June (A Doonesbury book)",G. B. Trudeau,1982,Henry Holt &amp; Co,http://images.amazon.com/images/P/0030615321.0...,1
4,277427,0060002050,0,On a Wicked Dawn (Cynster Novels),Stephanie Laurens,2002,Avon Books,http://images.amazon.com/images/P/0060002050.0...,13

In [68]:
# Filter the final_rating DataFrame to include only books that have received at least 50 ratings
# final_rating['number_of_rating'] refers to the column that stores the count of ratings for each book
# >= 50 ensures we keep only books with 50 or more ratings, helping to focus on more popular books

final_rating = final_rating[final_rating['number_of_rating'] >= 50]

In [69]:
final_rating.head()

,user_id,ISBN,rating,title,author,year,publisher,image_url,number_of_rating
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...,82
13,277427,0060930535,0,The Poisonwood Bible: A Novel,Barbara Kingsolver,1999,Perennial,http://images.amazon.com/images/P/0060930535.0...,133
15,277427,0060934417,0,Bel Canto: A Novel,Ann Patchett,2002,Perennial,http://images.amazon.com/images/P/0060934417.0...,108
18,277427,0061009059,9,One for the Money (Stephanie Plum Novels (Pape...,Janet Evanovich,1995,HarperTorch,http://images.amazon.com/images/P/0061009059.0...,108
24,277427,006440188X,0,The Secret Garden,Frances Hodgson Burnett,1998,HarperTrophy,http://images.amazon.com/images/P/006440188X.0...,79